Roland665/MiniCar_Guet/MiniCar_V2.0/.pack/Keil/TM4C_DFP.1.1.0/SVD/TM4C129/TM4C1294KCPDT.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="WATCHDOG0">
      <name>WATCHDOG1</name>
      <prependToName>WATCHDOG1</prependToName>
      <baseAddress>0x40001000</baseAddress>
    </peripheral>
    <peripheral>
      <name>SSI0</name>
      <description>Register map for SSI0 peripheral</description>
      <groupName>SSI</groupName>
      <prependToName>SSI0</prependToName>
      <baseAddress>0x40008000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt><name>SSI0</name><value>7</value></interrupt>
      <registers>
        <register>
          <name>CR0</name>
          <description>SSI Control 0</description>
          <addressOffset>0x00000000</addressOffset>
          <fields>
            <field>
              <name>SSI_CR0_DSS</name>
              <description>SSI Data Size Select</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSI_CR0_DSS_4</name>
                  <description>4-bit data</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_CR0_DSS_5</name>
                  <description>5-bit data</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_CR0_DSS_6</name>
                  <description>6-bit data</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_CR0_DSS_7</name>
                  <description>7-bit data</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_CR0_DSS_8</name>
                  <description>8-bit data</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_CR0_DSS_9</name>
                  <description>9-bit data</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_CR0_DSS_10</name>
                  <description>10-bit data</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_CR0_DSS_11</name>
                  <description>11-bit data</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_CR0_DSS_12</name>
                  <description>12-bit data</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_CR0_DSS_13</name>
                  <description>13-bit data</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_CR0_DSS_14</name>
                  <description>14-bit data</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_CR0_DSS_15</name>
                  <description>15-bit data</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_CR0_DSS_16</name>
                  <description>16-bit data</description>
                  <value>0xf</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SSI_CR0_FRF</name>
              <description>SSI Frame Format Select</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSI_CR0_FRF_MOTO</name>
                  <description>Freescale SPI Frame Format</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_CR0_FRF_TI</name>
                  <description>Synchronous Serial Frame Format</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SSI_CR0_SPO</name>
              <description>SSI Serial Clock Polarity</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SSI_CR0_SPH</name>
              <description>SSI Serial Clock Phase</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SSI_CR0_SCR</name>
              <description>SSI Serial Clock Rate</description>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR1</name>
          <description>SSI Control 1</description>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>SSI_CR1_LBM</name>
              <description>SSI Loopback Mode</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SSI_CR1_SSE</name>
              <description>SSI Synchronous Serial Port Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SSI_CR1_MS</name>
              <description>SSI Master/Slave Select</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SSI_CR1_EOT</name>
              <description>End of Transmission</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SSI_CR1_MODE</name>
              <description>SSI Mode</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSI_CR1_MODE_LEGACY</name>
                  <description>Legacy SSI mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_CR1_MODE_BI</name>
                  <description>Bi-SSI mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_CR1_MODE_QUAD</name>
                  <description>Quad-SSI Mode</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_CR1_MODE_ADVANCED</name>
                  <description>Advanced SSI Mode with 8-bit packet size</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SSI_CR1_DIR</name>
              <description>SSI Direction of Operation</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SSI_CR1_HSCLKEN</name>
              <description>High Speed Clock Enable</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SSI_CR1_FSSHLDFRM</name>
              <description>FSS Hold Frame</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SSI_CR1_EOM</name>
              <description>Stop Frame (End of Message)</description>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <description>SSI Data</description>
          <addressOffset>0x00000008</addressOffset>
          <fields>
            <field>
              <name>SSI_DR_DATA</name>
              <description>SSI Receive/Transmit Data</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>SSI Status</description>
          <addressOffset>0x0000000C</addressOffset>
          <fields>
            <field>
              <name>SSI_SR_TFE</name>
              <description>SSI Transmit FIFO Empty</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SSI_SR_TNF</name>
              <description>SSI Transmit FIFO Not Full</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SSI_SR_RNE</name>
              <description>SSI Receive FIFO Not Empty</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SSI_SR_RFF</name>
              <description>SSI Receive FIFO Full</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SSI_SR_BSY</name>
              <description>SSI Busy Bit</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPSR</name>
          <description>SSI Clock Prescale</description>
          <addressOffset>0x00000010</addressOffset>
          <fields>
            <field>
              <name>SSI_CPSR_CPSDVSR</name>
              <description>SSI Clock Prescale Divisor</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IM</name>
          <description>SSI Interrupt Mask</description>
          <addressOffset>0x00000014</addressOffset>
          <fields>
            <field>
              <name>SSI_IM_RORIM</name>
              <description>SSI Receive Overrun Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SSI_IM_RTIM</name>
              <description>SSI Receive Time-Out Interrupt Mask</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SSI_IM_RXIM</name>
              <description>SSI Receive FIFO Interrupt Mask</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SSI_IM_TXIM</name>
              <description>SSI Transmit FIFO Interrupt Mask</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SSI_IM_DMARXIM</name>
              <description>SSI Receive DMA Interrupt Mask</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SSI_IM_DMATXIM</name>
              <description>SSI Transmit DMA Interrupt Mask</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SSI_IM_EOTIM</name>
              <description>End of Transmit Interrupt Mask</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RIS</name>
          <description>SSI Raw Interrupt Status</description>
          <addressOffset>0x00000018</addressOffset>
          <fields>
            <field>
              <name>SSI_RIS_RORRIS</name>
              <description>SSI Receive Overrun Raw Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SSI_RIS_RTRIS</name>
              <description>SSI Receive Time-Out Raw Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SSI_RIS_RXRIS</name>
              <description>SSI Receive FIFO Raw Interrupt Status</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SSI_RIS_TXRIS</name>
              <description>SSI Transmit FIFO Raw Interrupt Status</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SSI_RIS_DMARXRIS</name>
              <description>SSI Receive DMA Raw Interrupt Status</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SSI_RIS_DMATXRIS</name>
              <description>SSI Transmit DMA Raw Interrupt Status</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SSI_RIS_EOTRIS</name>
              <description>End of Transmit Raw Interrupt Status</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MIS</name>
          <description>SSI Masked Interrupt Status</description>
          <addressOffset>0x0000001C</addressOffset>
          <fields>
            <field>
              <name>SSI_MIS_RORMIS</name>
              <description>SSI Receive Overrun Masked Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SSI_MIS_RTMIS</name>
              <description>SSI Receive Time-Out Masked Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SSI_MIS_RXMIS</name>
              <description>SSI Receive FIFO Masked Interrupt Status</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SSI_MIS_TXMIS</name>
              <description>SSI Transmit FIFO Masked Interrupt Status</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SSI_MIS_DMARXMIS</name>
              <description>SSI Receive DMA Masked Interrupt Status</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SSI_MIS_DMATXMIS</name>
              <description>SSI Transmit DMA Masked Interrupt Status</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SSI_MIS_EOTMIS</name>
              <description>End of Transmit Masked Interrupt Status</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <description>SSI Interrupt Clear</description>
          <addressOffset>0x00000020</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>SSI_ICR_RORIC</name>
              <description>SSI Receive Overrun Interrupt Clear</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>SSI_ICR_RTIC</name>
              <description>SSI Receive Time-Out Interrupt Clear</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>SSI_ICR_DMARXIC</name>
              <description>SSI Receive DMA Interrupt Clear</description>
              <bitRange>[4:4]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>SSI_ICR_DMATXIC</name>
              <description>SSI Transmit DMA Interrupt Clear</description>
              <bitRange>[5:5]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>SSI_ICR_EOTIC</name>
              <description>End of Transmit Interrupt Clear</description>
              <bitRange>[6:6]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACTL</name>
          <description>SSI DMA Control</description>
          <addressOffset>0x00000024</addressOffset>
          <fields>
            <field>
              <name>SSI_DMACTL_RXDMAE</name>
              <description>Receive DMA Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SSI_DMACTL_TXDMAE</name>
              <description>Transmit DMA Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PP</name>
          <description>SSI Peripheral Properties</description>
          <addressOffset>0x00000FC0</addressOffset>
          <fields>
            <field>
              <name>SSI_PP_HSCLK</name>
              <description>High Speed Capability</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SSI_PP_MODE</name>
              <description>Mode of Operation</description>
              <bitRange>[2:1]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSI_PP_MODE_LEGACY</name>
                  <description>Legacy SSI mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_PP_MODE_ADVBI</name>
                  <description>Legacy mode, Advanced SSI mode and Bi-SSI mode enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_PP_MODE_ADVBIQUAD</name>
                  <description>Legacy mode, Advanced mode, Bi-SSI and Quad-SSI mode enabled</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SSI_PP_FSSHLDFRM</name>
              <description>FSS Hold Frame Capability</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CC</name>
          <description>SSI Clock Configuration</description>
          <addressOffset>0x00000FC8</addressOffset>
          <fields>
            <field>
              <name>SSI_CC_CS</name>
              <description>SSI Baud Clock Source</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSI_CC_CS_SYSPLL</name>
                  <description>System clock (based on clock source and divisor factor)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_CC_CS_PIOSC</name>
                  <description>PIOSC</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
