Roland665/MiniCar_Guet/MiniCar_V2.0/.pack/Keil/TM4C_DFP.1.1.0/SVD/TM4C129/TM4C1294KCPDT.svd
        <register>
          <name>MIS</name>
          <description>UART Masked Interrupt Status</description>
          <addressOffset>0x00000040</addressOffset>
          <fields>
            <field>
              <name>UART_MIS_RIMIS</name>
              <description>UART Ring Indicator Modem Masked Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>UART_MIS_CTSMIS</name>
              <description>UART Clear to Send Modem Masked Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>UART_MIS_DCDMIS</name>
              <description>UART Data Carrier Detect Modem Masked Interrupt Status</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>UART_MIS_DSRMIS</name>
              <description>UART Data Set Ready Modem Masked Interrupt Status</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>UART_MIS_RXMIS</name>
              <description>UART Receive Masked Interrupt Status</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>UART_MIS_TXMIS</name>
              <description>UART Transmit Masked Interrupt Status</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>UART_MIS_RTMIS</name>
              <description>UART Receive Time-Out Masked Interrupt Status</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>UART_MIS_FEMIS</name>
              <description>UART Framing Error Masked Interrupt Status</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>UART_MIS_PEMIS</name>
              <description>UART Parity Error Masked Interrupt Status</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>UART_MIS_BEMIS</name>
              <description>UART Break Error Masked Interrupt Status</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>UART_MIS_OEMIS</name>
              <description>UART Overrun Error Masked Interrupt Status</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>UART_MIS_EOTMIS</name>
              <description>End of Transmission Masked Interrupt Status</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>UART_MIS_9BITMIS</name>
              <description>9-Bit Mode Masked Interrupt Status</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>UART_MIS_DMARXMIS</name>
              <description>Receive DMA Masked Interrupt Status</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>UART_MIS_DMATXMIS</name>
              <description>Transmit DMA Masked Interrupt Status</description>
              <bitRange>[17:17]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <description>UART Interrupt Clear</description>
          <addressOffset>0x00000044</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>UART_ICR_RIMIC</name>
              <description>UART Ring Indicator Modem Interrupt Clear</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>UART_ICR_CTSMIC</name>
              <description>UART Clear to Send Modem Interrupt Clear</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>UART_ICR_DCDMIC</name>
              <description>UART Data Carrier Detect Modem Interrupt Clear</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>UART_ICR_DSRMIC</name>
              <description>UART Data Set Ready Modem Interrupt Clear</description>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>UART_ICR_RXIC</name>
              <description>Receive Interrupt Clear</description>
              <bitRange>[4:4]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>UART_ICR_TXIC</name>
              <description>Transmit Interrupt Clear</description>
              <bitRange>[5:5]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>UART_ICR_RTIC</name>
              <description>Receive Time-Out Interrupt Clear</description>
              <bitRange>[6:6]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>UART_ICR_FEIC</name>
              <description>Framing Error Interrupt Clear</description>
              <bitRange>[7:7]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>UART_ICR_PEIC</name>
              <description>Parity Error Interrupt Clear</description>
              <bitRange>[8:8]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>UART_ICR_BEIC</name>
              <description>Break Error Interrupt Clear</description>
              <bitRange>[9:9]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>UART_ICR_OEIC</name>
              <description>Overrun Error Interrupt Clear</description>
              <bitRange>[10:10]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>UART_ICR_EOTIC</name>
              <description>End of Transmission Interrupt Clear</description>
              <bitRange>[11:11]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>UART_ICR_9BITIC</name>
              <description>9-Bit Mode Interrupt Clear</description>
              <bitRange>[12:12]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>UART_ICR_DMARXIC</name>
              <description>Receive DMA Interrupt Clear</description>
              <bitRange>[16:16]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>UART_ICR_DMATXIC</name>
              <description>Transmit DMA Interrupt Clear</description>
              <bitRange>[17:17]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACTL</name>
          <description>UART DMA Control</description>
          <addressOffset>0x00000048</addressOffset>
          <fields>
            <field>
              <name>UART_DMACTL_RXDMAE</name>
              <description>Receive DMA Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>UART_DMACTL_TXDMAE</name>
              <description>Transmit DMA Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>UART_DMACTL_DMAERR</name>
              <description>DMA on Error</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_9BITADDR</name>
          <description>UART 9-Bit Self Address</description>
          <addressOffset>0x000000A4</addressOffset>
          <fields>
            <field>
              <name>UART_9BITADDR_ADDR</name>
              <description>Self Address for 9-Bit Mode</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>UART_9BITADDR_9BITEN</name>
              <description>Enable 9-Bit Mode</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_9BITAMASK</name>
          <description>UART 9-Bit Self Address Mask</description>
          <addressOffset>0x000000A8</addressOffset>
          <fields>
            <field>
              <name>UART_9BITAMASK_MASK</name>
              <description>Self Address Mask for 9-Bit Mode</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PP</name>
          <description>UART Peripheral Properties</description>
          <addressOffset>0x00000FC0</addressOffset>
          <fields>
            <field>
              <name>UART_PP_SC</name>
              <description>Smart Card Support</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>UART_PP_NB</name>
              <description>9-Bit Support</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>UART_PP_MS</name>
              <description>Modem Support</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>UART_PP_MSE</name>
              <description>Modem Support Extended</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CC</name>
          <description>UART Clock Configuration</description>
          <addressOffset>0x00000FC8</addressOffset>
          <fields>
            <field>
              <name>UART_CC_CS</name>
              <description>UART Baud Clock Source</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART_CC_CS_SYSCLK</name>
                  <description>System clock (based on clock source and divisor factor)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART_CC_CS_PIOSC</name>
                  <description>PIOSC</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
