Roland665/MiniCar_Guet/MiniCar_V2.0/.pack/Keil/TM4C_DFP.1.1.0/SVD/TM4C129/TM4C1294KCPDT.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="I2C0">
      <name>I2C1</name>
      <prependToName>I2C1</prependToName>
      <baseAddress>0x40021000</baseAddress>
      <interrupt><name>I2C1</name><value>37</value></interrupt>
    </peripheral>
    <peripheral derivedFrom="I2C0">
      <name>I2C2</name>
      <prependToName>I2C2</prependToName>
      <baseAddress>0x40022000</baseAddress>
      <interrupt><name>I2C2</name><value>61</value></interrupt>
    </peripheral>
    <peripheral derivedFrom="I2C0">
      <name>I2C3</name>
      <prependToName>I2C3</prependToName>
      <baseAddress>0x40023000</baseAddress>
      <interrupt><name>I2C3</name><value>62</value></interrupt>
    </peripheral>
    <peripheral>
      <name>PWM0</name>
      <description>Register map for PWM0 peripheral</description>
      <groupName>PWM</groupName>
      <prependToName>PWM0</prependToName>
      <baseAddress>0x40028000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt><name>PWM0_0</name><value>10</value></interrupt>
      <interrupt><name>PWM0_1</name><value>11</value></interrupt>
      <interrupt><name>PWM0_2</name><value>12</value></interrupt>
      <interrupt><name>PWM0_3</name><value>43</value></interrupt>
      <interrupt><name>PWM0_FAULT</name><value>9</value></interrupt>
      <registers>
        <register>
          <name>CTL</name>
          <description>PWM Master Control</description>
          <addressOffset>0x00000000</addressOffset>
          <fields>
            <field>
              <name>PWM_CTL_GLOBALSYNC0</name>
              <description>Update PWM Generator 0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_CTL_GLOBALSYNC1</name>
              <description>Update PWM Generator 1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PWM_CTL_GLOBALSYNC2</name>
              <description>Update PWM Generator 2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PWM_CTL_GLOBALSYNC3</name>
              <description>Update PWM Generator 3</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNC</name>
          <description>PWM Time Base Sync</description>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>PWM_SYNC_SYNC0</name>
              <description>Reset Generator 0 Counter</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_SYNC_SYNC1</name>
              <description>Reset Generator 1 Counter</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PWM_SYNC_SYNC2</name>
              <description>Reset Generator 2 Counter</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PWM_SYNC_SYNC3</name>
              <description>Reset Generator 3 Counter</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ENABLE</name>
          <description>PWM Output Enable</description>
          <addressOffset>0x00000008</addressOffset>
          <fields>
            <field>
              <name>PWM_ENABLE_PWM0EN</name>
              <description>MnPWM0 Output Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_ENABLE_PWM1EN</name>
              <description>MnPWM1 Output Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PWM_ENABLE_PWM2EN</name>
              <description>MnPWM2 Output Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PWM_ENABLE_PWM3EN</name>
              <description>MnPWM3 Output Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PWM_ENABLE_PWM4EN</name>
              <description>MnPWM4 Output Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PWM_ENABLE_PWM5EN</name>
              <description>MnPWM5 Output Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PWM_ENABLE_PWM6EN</name>
              <description>MnPWM6 Output Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PWM_ENABLE_PWM7EN</name>
              <description>MnPWM7 Output Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>INVERT</name>
          <description>PWM Output Inversion</description>
          <addressOffset>0x0000000C</addressOffset>
          <fields>
            <field>
              <name>PWM_INVERT_PWM0INV</name>
              <description>Invert MnPWM0 Signal</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_INVERT_PWM1INV</name>
              <description>Invert MnPWM1 Signal</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PWM_INVERT_PWM2INV</name>
              <description>Invert MnPWM2 Signal</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PWM_INVERT_PWM3INV</name>
              <description>Invert MnPWM3 Signal</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PWM_INVERT_PWM4INV</name>
              <description>Invert MnPWM4 Signal</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PWM_INVERT_PWM5INV</name>
              <description>Invert MnPWM5 Signal</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PWM_INVERT_PWM6INV</name>
              <description>Invert MnPWM6 Signal</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PWM_INVERT_PWM7INV</name>
              <description>Invert MnPWM7 Signal</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FAULT</name>
          <description>PWM Output Fault</description>
          <addressOffset>0x00000010</addressOffset>
          <fields>
            <field>
              <name>PWM_FAULT_FAULT0</name>
              <description>MnPWM0 Fault</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_FAULT_FAULT1</name>
              <description>MnPWM1 Fault</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PWM_FAULT_FAULT2</name>
              <description>MnPWM2 Fault</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PWM_FAULT_FAULT3</name>
              <description>MnPWM3 Fault</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PWM_FAULT_FAULT4</name>
              <description>MnPWM4 Fault</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PWM_FAULT_FAULT5</name>
              <description>MnPWM5 Fault</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PWM_FAULT_FAULT6</name>
              <description>MnPWM6 Fault</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PWM_FAULT_FAULT7</name>
              <description>MnPWM7 Fault</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>INTEN</name>
          <description>PWM Interrupt Enable</description>
          <addressOffset>0x00000014</addressOffset>
          <fields>
            <field>
              <name>PWM_INTEN_INTPWM0</name>
              <description>PWM0 Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_INTEN_INTPWM1</name>
              <description>PWM1 Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PWM_INTEN_INTPWM2</name>
              <description>PWM2 Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PWM_INTEN_INTPWM3</name>
              <description>PWM3 Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PWM_INTEN_INTFAULT0</name>
              <description>Interrupt Fault 0</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>PWM_INTEN_INTFAULT1</name>
              <description>Interrupt Fault 1</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>PWM_INTEN_INTFAULT2</name>
              <description>Interrupt Fault 2</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>PWM_INTEN_INTFAULT3</name>
              <description>Interrupt Fault 3</description>
              <bitRange>[19:19]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RIS</name>
          <description>PWM Raw Interrupt Status</description>
          <addressOffset>0x00000018</addressOffset>
          <fields>
            <field>
              <name>PWM_RIS_INTPWM0</name>
              <description>PWM0 Interrupt Asserted</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_RIS_INTPWM1</name>
              <description>PWM1 Interrupt Asserted</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PWM_RIS_INTPWM2</name>
              <description>PWM2 Interrupt Asserted</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PWM_RIS_INTPWM3</name>
              <description>PWM3 Interrupt Asserted</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PWM_RIS_INTFAULT0</name>
              <description>Interrupt Fault PWM 0</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>PWM_RIS_INTFAULT1</name>
              <description>Interrupt Fault PWM 1</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>PWM_RIS_INTFAULT2</name>
              <description>Interrupt Fault PWM 2</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>PWM_RIS_INTFAULT3</name>
              <description>Interrupt Fault PWM 3</description>
              <bitRange>[19:19]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ISC</name>
          <description>PWM Interrupt Status and Clear</description>
          <addressOffset>0x0000001C</addressOffset>
          <fields>
            <field>
              <name>PWM_ISC_INTPWM0</name>
              <description>PWM0 Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_ISC_INTPWM1</name>
              <description>PWM1 Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PWM_ISC_INTPWM2</name>
              <description>PWM2 Interrupt Status</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PWM_ISC_INTPWM3</name>
              <description>PWM3 Interrupt Status</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PWM_ISC_INTFAULT0</name>
              <description>FAULT0 Interrupt Asserted</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>PWM_ISC_INTFAULT1</name>
              <description>FAULT1 Interrupt Asserted</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>PWM_ISC_INTFAULT2</name>
              <description>FAULT2 Interrupt Asserted</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>PWM_ISC_INTFAULT3</name>
              <description>FAULT3 Interrupt Asserted</description>
              <bitRange>[19:19]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>PWM Status</description>
          <addressOffset>0x00000020</addressOffset>
          <fields>
            <field>
              <name>PWM_STATUS_FAULT0</name>
              <description>Generator 0 Fault Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_STATUS_FAULT1</name>
              <description>Generator 1 Fault Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PWM_STATUS_FAULT2</name>
              <description>Generator 2 Fault Status</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PWM_STATUS_FAULT3</name>
              <description>Generator 3 Fault Status</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FAULTVAL</name>
          <description>PWM Fault Condition Value</description>
          <addressOffset>0x00000024</addressOffset>
          <fields>
            <field>
              <name>PWM_FAULTVAL_PWM0</name>
              <description>MnPWM0 Fault Value</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_FAULTVAL_PWM1</name>
              <description>MnPWM1 Fault Value</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PWM_FAULTVAL_PWM2</name>
              <description>MnPWM2 Fault Value</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PWM_FAULTVAL_PWM3</name>
              <description>MnPWM3 Fault Value</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PWM_FAULTVAL_PWM4</name>
              <description>MnPWM4 Fault Value</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PWM_FAULTVAL_PWM5</name>
              <description>MnPWM5 Fault Value</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PWM_FAULTVAL_PWM6</name>
              <description>MnPWM6 Fault Value</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PWM_FAULTVAL_PWM7</name>
              <description>MnPWM7 Fault Value</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
