Roland665/MiniCar_Guet/MiniCar_V2.0/.pack/Keil/TM4C_DFP.1.1.0/SVD/TM4C129/TM4C1294KCPDT.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>QEI0</name>
      <description>Register map for QEI0 peripheral</description>
      <groupName>QEI</groupName>
      <prependToName>QEI0</prependToName>
      <baseAddress>0x4002C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt><name>QEI0</name><value>13</value></interrupt>
      <registers>
        <register>
          <name>CTL</name>
          <description>QEI Control</description>
          <addressOffset>0x00000000</addressOffset>
          <fields>
            <field>
              <name>QEI_CTL_ENABLE</name>
              <description>Enable QEI</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>QEI_CTL_SWAP</name>
              <description>Swap Signals</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>QEI_CTL_SIGMODE</name>
              <description>Signal Mode</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>QEI_CTL_CAPMODE</name>
              <description>Capture Mode</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>QEI_CTL_RESMODE</name>
              <description>Reset Mode</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>QEI_CTL_VELEN</name>
              <description>Capture Velocity</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>QEI_CTL_VELDIV</name>
              <description>Predivide Velocity</description>
              <bitRange>[8:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QEI_CTL_VELDIV_1</name>
                  <description>QEI clock /1</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QEI_CTL_VELDIV_2</name>
                  <description>QEI clock /2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QEI_CTL_VELDIV_4</name>
                  <description>QEI clock /4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QEI_CTL_VELDIV_8</name>
                  <description>QEI clock /8</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QEI_CTL_VELDIV_16</name>
                  <description>QEI clock /16</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QEI_CTL_VELDIV_32</name>
                  <description>QEI clock /32</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QEI_CTL_VELDIV_64</name>
                  <description>QEI clock /64</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QEI_CTL_VELDIV_128</name>
                  <description>QEI clock /128</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QEI_CTL_INVA</name>
              <description>Invert PhA</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>QEI_CTL_INVB</name>
              <description>Invert PhB</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>QEI_CTL_INVI</name>
              <description>Invert Index Pulse</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>QEI_CTL_STALLEN</name>
              <description>Stall QEI</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>QEI_CTL_FILTEN</name>
              <description>Enable Input Filter</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>QEI_CTL_FILTCNT</name>
              <description>Input Filter Prescale Count</description>
              <bitRange>[19:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT</name>
          <description>QEI Status</description>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>QEI_STAT_ERROR</name>
              <description>Error Detected</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>QEI_STAT_DIRECTION</name>
              <description>Direction of Rotation</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>POS</name>
          <description>QEI Position</description>
          <addressOffset>0x00000008</addressOffset>
          <fields>
            <field>
              <name>QEI_POS</name>
              <description>Current Position Integrator Value</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MAXPOS</name>
          <description>QEI Maximum Position</description>
          <addressOffset>0x0000000C</addressOffset>
          <fields>
            <field>
              <name>QEI_MAXPOS</name>
              <description>Maximum Position Integrator Value</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LOAD</name>
          <description>QEI Timer Load</description>
          <addressOffset>0x00000010</addressOffset>
          <fields>
            <field>
              <name>QEI_LOAD</name>
              <description>Velocity Timer Load Value</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TIME</name>
          <description>QEI Timer</description>
          <addressOffset>0x00000014</addressOffset>
          <fields>
            <field>
              <name>QEI_TIME</name>
              <description>Velocity Timer Current Value</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>COUNT</name>
          <description>QEI Velocity Counter</description>
          <addressOffset>0x00000018</addressOffset>
          <fields>
            <field>
              <name>QEI_COUNT</name>
              <description>Velocity Pulse Count</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SPEED</name>
          <description>QEI Velocity</description>
          <addressOffset>0x0000001C</addressOffset>
          <fields>
            <field>
              <name>QEI_SPEED</name>
              <description>Velocity</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>INTEN</name>
          <description>QEI Interrupt Enable</description>
          <addressOffset>0x00000020</addressOffset>
          <fields>
            <field>
              <name>QEI_INTEN_INDEX</name>
              <description>Index Pulse Detected Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>QEI_INTEN_TIMER</name>
              <description>Timer Expires Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>QEI_INTEN_DIR</name>
              <description>Direction Change Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>QEI_INTEN_ERROR</name>
              <description>Phase Error Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RIS</name>
          <description>QEI Raw Interrupt Status</description>
          <addressOffset>0x00000024</addressOffset>
          <fields>
            <field>
              <name>QEI_RIS_INDEX</name>
              <description>Index Pulse Asserted</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>QEI_RIS_TIMER</name>
              <description>Velocity Timer Expired</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>QEI_RIS_DIR</name>
              <description>Direction Change Detected</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>QEI_RIS_ERROR</name>
              <description>Phase Error Detected</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ISC</name>
          <description>QEI Interrupt Status and Clear</description>
          <addressOffset>0x00000028</addressOffset>
          <fields>
            <field>
              <name>QEI_ISC_INDEX</name>
              <description>Index Pulse Interrupt</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>QEI_ISC_TIMER</name>
              <description>Velocity Timer Expired Interrupt</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>QEI_ISC_DIR</name>
              <description>Direction Change Interrupt</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>QEI_ISC_ERROR</name>
              <description>Phase Error Interrupt</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
